"""
Считайте 2 числа: n, m.
Создайте матрицу размера n*m такую что:
На границе матрицы будут стоять 1
Внутри матрицы будут стоять 0
Сохраните матрицу в переменную Z.
Sample Input 1:
10 10
Sample Output 1:
<class 'numpy.ndarray'>
[[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]]
Sample Input 2:
3 4
Sample Output 2:
<class 'numpy.ndarray'>
[[1. 1. 1. 1.]
 [1. 0. 0. 1.]
 [1. 1. 1. 1.]]
"""

import numpy as np

n, m = map(int, input().split())
Z = np.zeros((n, m))
Z[0][:] = 1
Z[n - 1][:] = 1
for i in range(n):
    Z[i][0] = 1
    Z[i][-1] = 1