"""
Выведите на печать версию модуля numpy, используемую в текущий момент в песочнице Stepik.
Sample Input:

Sample Output:
1.14.1
"""

import numpy as np

print(np.__version__)