"""
Считайте 2 числа:
seed
n
С помощью Numpy сгенерируйте n случайных чисел из интервала (0, 1)
с фиксированным seed, отсортируйте их по возрастанию и сохраните в переменную Z.
Sample Input 1:
42
10
Sample Output 1:
[0.05808361 0.15599452 0.15601864 0.37454012 0.59865848 0.60111501
 0.70807258 0.73199394 0.86617615 0.95071431]
Sample Input 2:
5
5
Sample Output 2:
[0.20671916 0.22199317 0.48841119 0.87073231 0.91861091]
"""

import numpy as np

np.random.seed(int(input()))
Z = np.random.random((int(input()), ))
Z = np.sort(Z)